{
    "data": [
        { "id": 1,
        "type":"news",
        "title": "Who has the best slower ball in T20 cricket?",
        "s_title":"Our writers pick which seamer most artfully deceives batters in the shortest format in men's cricket", 
        "desc1":"Mustafizur Rahman's ESPNcricinfo profile describes him as left-arm fast medium, but it's probably more accurate to call him a fast left-arm spinner. He can bowl with the seam up and occasionally hit speeds north of 140kph; sometimes he even swings the ball into the right-hander like other left-arm quicks. Mostly, though, he just lets his hyperflexible wrist do its thing. \n\n\n Because he bowls with his left arm, the Mustafizur cutter is a difficult ball to put a name to. Is it a legcutter, because the ball goes in that direction? Or is it an offcutter, because that gives you a clearer picture of his wrist action? \n\n Batters can sometimes look like they're puzzling over the semantics when they come face to face with Mustafizur's cutter and its unusual geometry. Delivered from left arm over to the right-hander, it pitches on or around leg stump, having at first dipped considerably, and breaks away with a surprising amount of kick. \n\n The slower ball in itself is no kind of weapon at all, of course; it's the expectation chasm created in the mind of a batter that does the damage. In that sense, a slower ball is as much a Jedi mind trick as it is sleight of hand, and few can claim to have perfected the art more cunningly than Mills. Blessed with extreme pace, he has the ability to go through his rapid bowling action with ostensibly no modification, delivering a ball so much slower it frazzles most batters' minds. At his best, he would make the most skilful batters look complete novices; Yuvraj Singh in a T20I and Chris Gayle in the PSL come to mind. His slower one is delivered out of the back of the hand, but even after release, it has a hypnotic effect on both batter and viewer that it is speeding along and might crunch into the helmet any moment.",
        "desc2":"I made my choice primarily on aesthetic value, which led me straight to Nathan Ellis' back-of-the-hand slower ball. It's mesmerising: he bounds up to the crease, just as quickly as if he is about to bowl a 140kph yorker, and his collapsed front leg means he has an unusually low release point. But the key part is that he manages to keep the seam perfectly upright, meaning there is no real tell for batters. \n\n It's effective, too. Ellis spent the Australian winter making English batters look silly during the Blast and the Hundred, and was unfortunate to miss out on Australia's squad for the T20 World Cup. Crucially, he knows when to dig into his box of tricks and is happy to do so under pressure, like when he beat Richard Gleeson's outside edge with the last ball of a chaotic final to seal Hampshire's Blast title this year. \n\n ",
        "author": "typicode",
        "media1":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_960/lsci/db/PICTURES/CMS/338100/338118.3.jpg",
        "media2":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_960/lsci/db/PICTURES/CMS/329500/329590.3.jpg"
    }
    ]
  }